# BWT - Deep Learning Track
## Data Wrangling : Join, Combine, and Reshape
### Adil Mubashir Chaudhry

In [3]:
import pandas as pd
import numpy as np

data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [4]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [5]:
data['b']

1   -0.654410
3    0.823702
dtype: float64

In [6]:
data['b':'c']

b  1   -0.654410
   3    0.823702
c  1    0.019072
   2   -1.148362
dtype: float64

In [7]:
data.loc[['b', 'd']]

b  1   -0.654410
   3    0.823702
d  2    1.639023
   3   -0.244746
dtype: float64

In [8]:
data.loc[:, 2]

a   -0.346510
c   -1.148362
d    1.639023
dtype: float64

In [9]:
data.unstack()

          1         2         3
a -0.714209 -0.346510  1.439699
b -0.654410       NaN  0.823702
c  0.019072 -1.148362       NaN
d       NaN  1.639023 -0.244746

### Combining and Merging Datasets

Data contained in pandas objects can be combined together in a number of ways:


• pandas.merge connects rows in DataFrames based on one or more keys. This
will be familiar to users of SQL or other relational databases, as it implements
database join operations.


• pandas.concat concatenates or “stacks” together objects along an axis.


• The combine_first instance method enables splicing together overlapping data
to fill in missing values in one object with values from another.

In [11]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})

df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})

In [12]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [13]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [14]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [15]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

### Reshaping

There are a number of basic operations for rearranging tabular data. These are alternatingly
referred to as reshape or pivot operations.

In [18]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'],
                        name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5